XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
/****************************************************************
 * Copyright (C) 2016, XinLi, all right reserved.
 * File name:    USART.c
 * Date:         2016.03.22
 * Description:  USART driver.
*****************************************************************/

/****************************************************************
 *                        Header include
*****************************************************************/
#include "USART.h"
#include <string.h>

/****************************************************************
 *                       Global variables
*****************************************************************/
#if (USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx) || (USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx)
static bool USART1_RCC_Flag = false, USART1_GPIO_Flag = false, USART1_NVIC_Flag = false;

#if USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx
static bool USART1_DMA_Tx_Flag = false, USART1_SendData_Flag = false;
static uint32_t USART1_SendData_P = NULL;
static uint8_t USART1_Buffer_Tx[USART1_BufferSize_Tx]         = {NULL};
static uint8_t USART1_DMA_Buffer_Tx[USART1_DMA_BufferSize_Tx] = {NULL};
static void (*USART1_SendDataFinishCallback)(void) = NULL;
static uint64_t USART1_SendDataCount = NULL;
#endif /* USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx */

#if USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx
static bool USART1_DMA_Rx_Flag = false;
static uint32_t USART1_ReceiveData_P = NULL;
static uint8_t USART1_Buffer_Rx[USART1_BufferSize_Rx]         = {NULL};
static uint8_t USART1_DMA_Buffer_Rx[USART1_DMA_BufferSize_Rx] = {NULL};
static void (*USART1_ReceiveDataFinishCallback)(void) = NULL;
static uint64_t USART1_ReceiveDataCount = NULL;
#endif /* USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx */
#endif /* (USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx) || (USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx) */

#if (USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx) || (USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx)
static bool USART2_RCC_Flag = false, USART2_GPIO_Flag = false, USART2_NVIC_Flag = false;

#if USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx
static bool USART2_DMA_Tx_Flag = false, USART2_SendData_Flag = false;
static uint32_t USART2_SendData_P = NULL;
static uint8_t USART2_Buffer_Tx[USART2_BufferSize_Tx]         = {NULL};
static uint8_t USART2_DMA_Buffer_Tx[USART2_DMA_BufferSize_Tx] = {NULL};
static void (*USART2_SendDataFinishCallback)(void) = NULL;
static uint64_t USART2_SendDataCount = NULL;
#endif /* USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx */

#if USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx
static bool USART2_DMA_Rx_Flag = false;
static uint32_t USART2_ReceiveData_P = NULL;
static uint8_t USART2_Buffer_Rx[USART2_BufferSize_Rx]         = {NULL};
static uint8_t USART2_DMA_Buffer_Rx[USART2_DMA_BufferSize_Rx] = {NULL};
static void (*USART2_ReceiveDataFinishCallback)(void) = NULL;
static uint64_t USART2_ReceiveDataCount = NULL;
#endif /* USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx */
#endif /* (USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx) || (USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx) */

#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
#if (USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx) || (USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx)
static bool USART3_RCC_Flag = false, USART3_GPIO_Flag = false, USART3_NVIC_Flag = false;

#if USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx
static bool USART3_DMA_Tx_Flag = false, USART3_SendData_Flag = false;
static uint32_t USART3_SendData_P = NULL;
static uint8_t USART3_Buffer_Tx[USART3_BufferSize_Tx]         = {NULL};
static uint8_t USART3_DMA_Buffer_Tx[USART3_DMA_BufferSize_Tx] = {NULL};
static void (*USART3_SendDataFinishCallback)(void) = NULL;
static uint64_t USART3_SendDataCount = NULL;
#endif /* USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx */

#if USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx
static bool USART3_DMA_Rx_Flag = false;
static uint32_t USART3_ReceiveData_P = NULL;
static uint8_t USART3_Buffer_Rx[USART3_BufferSize_Rx]         = {NULL};
static uint8_t USART3_DMA_Buffer_Rx[USART3_DMA_BufferSize_Rx] = {NULL};
static void (*USART3_ReceiveDataFinishCallback)(void) = NULL;
static uint64_t USART3_ReceiveDataCount = NULL;
#endif /* USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx */
#endif /* (USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx) || (USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx) */
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */

#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
#if (USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx) || (USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx)
static bool USART4_RCC_Flag = false, USART4_GPIO_Flag = false, USART4_NVIC_Flag = false;

#if USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx
static bool USART4_DMA_Tx_Flag = false, USART4_SendData_Flag = false;
static uint32_t USART4_SendData_P = NULL;
static uint8_t USART4_Buffer_Tx[USART4_BufferSize_Tx]         = {NULL};
static uint8_t USART4_DMA_Buffer_Tx[USART4_DMA_BufferSize_Tx] = {NULL};
static void (*USART4_SendDataFinishCallback)(void) = NULL;
static uint64_t USART4_SendDataCount = NULL;
#endif /* USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx */

#if USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx
static bool USART4_DMA_Rx_Flag = false;
static uint32_t USART4_ReceiveData_P = NULL;
static uint8_t USART4_Buffer_Rx[USART4_BufferSize_Rx]         = {NULL};
static uint8_t USART4_DMA_Buffer_Rx[USART4_DMA_BufferSize_Rx] = {NULL};
static void (*USART4_ReceiveDataFinishCallback)(void) = NULL;
static uint64_t USART4_ReceiveDataCount = NULL;
#endif /* USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx */
#endif /* (USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx) || (USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx) */

#if (USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx) || (USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx)
static bool USART5_RCC_Flag = false, USART5_GPIO_Flag = false, USART5_NVIC_Flag = false;

