XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
#if USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx
static bool USART5_DMA_Tx_Flag = false, USART5_SendData_Flag = false;
static uint32_t USART5_SendData_P = NULL;
static uint8_t USART5_Buffer_Tx[USART5_BufferSize_Tx]         = {NULL};
static uint8_t USART5_DMA_Buffer_Tx[USART5_DMA_BufferSize_Tx] = {NULL};
static void (*USART5_SendDataFinishCallback)(void) = NULL;
static uint64_t USART5_SendDataCount = NULL;
#endif /* USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx */

#if USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx
static bool USART5_DMA_Rx_Flag = false;
static uint32_t USART5_ReceiveData_P = NULL;
static uint8_t USART5_Buffer_Rx[USART5_BufferSize_Rx]         = {NULL};
static uint8_t USART5_DMA_Buffer_Rx[USART5_DMA_BufferSize_Rx] = {NULL};
static void (*USART5_ReceiveDataFinishCallback)(void) = NULL;
static uint64_t USART5_ReceiveDataCount = NULL;
#endif /* USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx */
#endif /* (USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx) || (USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx) */
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */

#if (USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx) || (USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx)
static bool USART6_RCC_Flag = false, USART6_GPIO_Flag = false, USART6_NVIC_Flag = false;

#if USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx
static bool USART6_DMA_Tx_Flag = false, USART6_SendData_Flag = false;
static uint32_t USART6_SendData_P = NULL;
static uint8_t USART6_Buffer_Tx[USART6_BufferSize_Tx]         = {NULL};
static uint8_t USART6_DMA_Buffer_Tx[USART6_DMA_BufferSize_Tx] = {NULL};
static void (*USART6_SendDataFinishCallback)(void) = NULL;
static uint64_t USART6_SendDataCount = NULL;
#endif /* USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx */

#if USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx
static bool USART6_DMA_Rx_Flag = false;
static uint32_t USART6_ReceiveData_P = NULL;
static uint8_t USART6_Buffer_Rx[USART6_BufferSize_Rx]         = {NULL};
static uint8_t USART6_DMA_Buffer_Rx[USART6_DMA_BufferSize_Rx] = {NULL};
static void (*USART6_ReceiveDataFinishCallback)(void) = NULL;
static uint64_t USART6_ReceiveDataCount = NULL;
#endif /* USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx */
#endif /* (USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx) || (USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx) */

#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
#if (USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx) || (USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx)
static bool USART7_RCC_Flag = false, USART7_GPIO_Flag = false, USART7_NVIC_Flag = false;

#if USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx
static bool USART7_DMA_Tx_Flag = false, USART7_SendData_Flag = false;
static uint32_t USART7_SendData_P = NULL;
static uint8_t USART7_Buffer_Tx[USART7_BufferSize_Tx]         = {NULL};
static uint8_t USART7_DMA_Buffer_Tx[USART7_DMA_BufferSize_Tx] = {NULL};
static void (*USART7_SendDataFinishCallback)(void) = NULL;
static uint64_t USART7_SendDataCount = NULL;
#endif /* USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx */

#if USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx
static bool USART7_DMA_Rx_Flag = false;
static uint32_t USART7_ReceiveData_P = NULL;
static uint8_t USART7_Buffer_Rx[USART7_BufferSize_Rx]         = {NULL};
static uint8_t USART7_DMA_Buffer_Rx[USART7_DMA_BufferSize_Rx] = {NULL};
static void (*USART7_ReceiveDataFinishCallback)(void) = NULL;
static uint64_t USART7_ReceiveDataCount = NULL;
#endif /* USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx */
#endif /* (USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx) || (USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx) */

#if (USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx) || (USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx)
static bool USART8_RCC_Flag = false, USART8_GPIO_Flag = false, USART8_NVIC_Flag = false;

#if USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx
static bool USART8_DMA_Tx_Flag = false, USART8_SendData_Flag = false;
static uint32_t USART8_SendData_P = NULL;
static uint8_t USART8_Buffer_Tx[USART8_BufferSize_Tx]         = {NULL};
static uint8_t USART8_DMA_Buffer_Tx[USART8_DMA_BufferSize_Tx] = {NULL};
static void (*USART8_SendDataFinishCallback)(void) = NULL;
static uint64_t USART8_SendDataCount = NULL;
#endif /* USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx */

#if USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx
static bool USART8_DMA_Rx_Flag = false;
static uint32_t USART8_ReceiveData_P = NULL;
static uint8_t USART8_Buffer_Rx[USART8_BufferSize_Rx]         = {NULL};
static uint8_t USART8_DMA_Buffer_Rx[USART8_DMA_BufferSize_Rx] = {NULL};
static void (*USART8_ReceiveDataFinishCallback)(void) = NULL;
static uint64_t USART8_ReceiveDataCount = NULL;
#endif /* USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx */
#endif /* (USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx) || (USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx) */
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */

#if defined(STM32F413_423xx)
#if (USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx) || (USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx)
static bool USART9_RCC_Flag = false, USART9_GPIO_Flag = false, USART9_NVIC_Flag = false;

#if USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx
static bool USART9_DMA_Tx_Flag = false, USART9_SendData_Flag = false;
static uint32_t USART9_SendData_P = NULL;
static uint8_t USART9_Buffer_Tx[USART9_BufferSize_Tx]         = {NULL};
static uint8_t USART9_DMA_Buffer_Tx[USART9_DMA_BufferSize_Tx] = {NULL};
static void (*USART9_SendDataFinishCallback)(void) = NULL;
static uint64_t USART9_SendDataCount = NULL;
#endif /* USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx */

#if USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx
static bool USART9_DMA_Rx_Flag = false;
static uint32_t USART9_ReceiveData_P = NULL;
static uint8_t USART9_Buffer_Rx[USART9_BufferSize_Rx]         = {NULL};
static uint8_t USART9_DMA_Buffer_Rx[USART9_DMA_BufferSize_Rx] = {NULL};
static void (*USART9_ReceiveDataFinishCallback)(void) = NULL;
static uint64_t USART9_ReceiveDataCount = NULL;
#endif /* USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx */
#endif /* (USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx) || (USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx) */

