XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
#if (USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx) || (USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx)
static bool USART10_RCC_Flag = false, USART10_GPIO_Flag = false, USART10_NVIC_Flag = false;

#if USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx
static bool USART10_DMA_Tx_Flag = false, USART10_SendData_Flag = false;
static uint32_t USART10_SendData_P = NULL;
static uint8_t USART10_Buffer_Tx[USART10_BufferSize_Tx]         = {NULL};
static uint8_t USART10_DMA_Buffer_Tx[USART10_DMA_BufferSize_Tx] = {NULL};
static void (*USART10_SendDataFinishCallback)(void) = NULL;
static uint64_t USART10_SendDataCount = NULL;
#endif /* USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx */

#if USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx
static bool USART10_DMA_Rx_Flag = false;
static uint32_t USART10_ReceiveData_P = NULL;
static uint8_t USART10_Buffer_Rx[USART10_BufferSize_Rx]         = {NULL};
static uint8_t USART10_DMA_Buffer_Rx[USART10_DMA_BufferSize_Rx] = {NULL};
static void (*USART10_ReceiveDataFinishCallback)(void) = NULL;
static uint64_t USART10_ReceiveDataCount = NULL;
#endif /* USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx */
#endif /* (USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx) || (USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx) */
#endif /* STM32F413_423xx */

/****************************************************************
 *                     Function declaration
*****************************************************************/
static void USART_DMA_TX_Configure(USART_TypeDef* USARTx);
static void USART_DMA_RX_Configure(USART_TypeDef* USARTx);
static void USART_DMA_TX_Unconfigure(USART_TypeDef* USARTx);
static void USART_DMA_RX_Unconfigure(USART_TypeDef* USARTx);
static void USART_NVIC_Configure(USART_TypeDef* USARTx);
static void USART_NVIC_Unconfigure(USART_TypeDef* USARTx);
static void USART_SendDataFinishCallback(USART_TypeDef* USARTx);
static void USART_ReceiveDataFinishCallback(USART_TypeDef* USARTx);

/****************************************************************
 *                     Function definition
*****************************************************************/

/****************************************************************
 * Function:    USART_Configure
 * Description: Configure.
 * Input:       USARTx:   Where x can be 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 to select the USART or UART peripheral.
 *              BaudRate: Communication baud rate.
 *              DataBits: The number of data bits sent or received.
 *              StopBits: The number of stop bits to send or receive.
 *              Parity:   Parity mode.
 * Output:
 * Return:
*****************************************************************/
void USART_Configure(USART_TypeDef* USARTx, USART_BaudRate BaudRate, USART_DataBits DataBits, USART_StopBits StopBits, USART_Parity Parity)
{
  uint16_t          USART_Mode          =  NULL;  /* USART Mode definition */
  GPIO_InitTypeDef  GPIO_InitStructure  = {NULL}; /* GPIO Init structure definition */
  USART_InitTypeDef USART_InitStructure = {NULL}; /* USART Init Structure definition */
  
  if(USARTx == USART1)
  {
#if (USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx) || (USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx)
#if USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx
    USART_Mode          |= USART_Mode_Tx;
    USART1_SendData_Flag = false;
    USART1_SendData_P    = NULL;
#endif /* USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx */
    
#if USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx
    USART_Mode          |= USART_Mode_Rx;
    USART1_ReceiveData_P = NULL;
#endif /* USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx */
    
    if(USART1_RCC_Flag == false)
    {
      USART1_RCC_Flag = true;
      
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);  /* Enable USART1 clock */
    }
    
    if(USART1_GPIO_Flag == false)
    {
      USART1_GPIO_Flag = true;
      
      RCC_AHB1PeriphClockCmd(USART1_Tx_RCC_AHB1Periph_GPIO, ENABLE);  /* Enable USART1_Tx GPIO clock */
      RCC_AHB1PeriphClockCmd(USART1_Rx_RCC_AHB1Periph_GPIO, ENABLE);  /* Enable USART1_Rx GPIO clock */
      
      GPIO_PinAFConfig(USART1_Tx_GPIO, USART1_Tx_GPIO_PinSource, GPIO_AF_USART1); /* Connect GPIOxn to USART1_Tx */
      GPIO_PinAFConfig(USART1_Rx_GPIO, USART1_Rx_GPIO_PinSource, GPIO_AF_USART1); /* Connect GPIOxn to USART1_Rx */
      
      GPIO_InitStructure.GPIO_Pin = USART1_Tx_GPIO_Pin;   /* Specifies the GPIO pins to be configured. */
      GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;        /* Specifies the operating mode for the selected pins. */
      GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;  /* Specifies the speed for the selected pins. */
      GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;      /* Specifies the operating output type for the selected pins. */
      GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;        /* Specifies the operating Pull-up/Pull down for the selected pins. */
      GPIO_Init(USART1_Tx_GPIO, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
      
      GPIO_InitStructure.GPIO_Pin = USART1_Rx_GPIO_Pin;   /* Specifies the GPIO pins to be configured. */
      GPIO_Init(USART1_Rx_GPIO, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
    }
#else
    return;
#endif /* (USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx) || (USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx) */
  }
  else if(USARTx == USART2)
  {
#if (USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx) || (USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx)
#if USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx
    USART_Mode          |= USART_Mode_Tx;
    USART2_SendData_Flag = false;
    USART2_SendData_P    = NULL;
#endif /* USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx */
    
#if USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx
    USART_Mode          |= USART_Mode_Rx;
    USART2_ReceiveData_P = NULL;
#endif /* USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx */
    
    if(USART2_RCC_Flag == false)
    {
      USART2_RCC_Flag = true;
      
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);  /* Enable USART2 clock */
    }
    
    if(USART2_GPIO_Flag == false)
    {
      USART2_GPIO_Flag = true;
      
      RCC_AHB1PeriphClockCmd(USART2_Tx_RCC_AHB1Periph_GPIO, ENABLE);  /* Enable USART2_Tx GPIO clock */
      RCC_AHB1PeriphClockCmd(USART2_Rx_RCC_AHB1Periph_GPIO, ENABLE);  /* Enable USART2_Rx GPIO clock */
      
