XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
      GPIO_PinAFConfig(USART2_Tx_GPIO, USART2_Tx_GPIO_PinSource, GPIO_AF_USART2);	/* Connect GPIOxn to USART2_Tx */
      GPIO_PinAFConfig(USART2_Rx_GPIO, USART2_Rx_GPIO_PinSource, GPIO_AF_USART2); /* Connect GPIOxn to USART2_Rx */
      
      GPIO_InitStructure.GPIO_Pin = USART2_Tx_GPIO_Pin;   /* Specifies the GPIO pins to be configured. */
      GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;        /* Specifies the operating mode for the selected pins. */
      GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;  /* Specifies the speed for the selected pins. */
      GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;      /* Specifies the operating output type for the selected pins. */
      GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;        /* Specifies the operating Pull-up/Pull down for the selected pins. */
      GPIO_Init(USART2_Tx_GPIO, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
      
      GPIO_InitStructure.GPIO_Pin = USART2_Rx_GPIO_Pin;   /* Specifies the GPIO pins to be configured. */
      GPIO_Init(USART2_Rx_GPIO, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
    }
#else
    return;
#endif /* (USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx) || (USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx) */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if (USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx) || (USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx)
#if USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx
    USART_Mode          |= USART_Mode_Tx;
    USART3_SendData_Flag = false;
    USART3_SendData_P    = NULL;
#endif /* USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx */
    
#if USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx
    USART_Mode          |= USART_Mode_Rx;
    USART3_ReceiveData_P = NULL;
#endif /* USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx */
    
    if(USART3_RCC_Flag == false)
    {
      USART3_RCC_Flag = true;
      
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);  /* Enable USART3 clock */
    }
    
    if(USART3_GPIO_Flag == false)
    {
      USART3_GPIO_Flag = true;
      
      RCC_AHB1PeriphClockCmd(USART3_Tx_RCC_AHB1Periph_GPIO, ENABLE);  /* Enable USART3_Tx GPIO clock */
      RCC_AHB1PeriphClockCmd(USART3_Rx_RCC_AHB1Periph_GPIO, ENABLE);  /* Enable USART3_Rx GPIO clock */
      
      GPIO_PinAFConfig(USART3_Tx_GPIO, USART3_Tx_GPIO_PinSource, GPIO_AF_USART3); /* Connect GPIOxn to USART3_Tx */
      GPIO_PinAFConfig(USART3_Rx_GPIO, USART3_Rx_GPIO_PinSource, GPIO_AF_USART3); /* Connect GPIOxn to USART3_Rx */
      
      GPIO_InitStructure.GPIO_Pin = USART3_Tx_GPIO_Pin;   /* Specifies the GPIO pins to be configured. */
      GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;        /* Specifies the operating mode for the selected pins. */
      GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;  /* Specifies the speed for the selected pins. */
      GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;      /* Specifies the operating output type for the selected pins. */
      GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;        /* Specifies the operating Pull-up/Pull down for the selected pins. */
      GPIO_Init(USART3_Tx_GPIO, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
      
      GPIO_InitStructure.GPIO_Pin = USART3_Rx_GPIO_Pin;   /* Specifies the GPIO pins to be configured. */
      GPIO_Init(USART3_Rx_GPIO, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
    }
#else
    return;
#endif /* (USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx) || (USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx) */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if (USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx) || (USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx)
#if USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx
    USART_Mode          |= USART_Mode_Tx;
    USART4_SendData_Flag = false;
    USART4_SendData_P    = NULL;
#endif /* USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx */
    
#if USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx
    USART_Mode          |= USART_Mode_Rx;
    USART4_ReceiveData_P = NULL;
#endif /* USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx */
    
    if(USART4_RCC_Flag == false)
    {
      USART4_RCC_Flag = true;
      
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, ENABLE); /* Enable USART4 clock */
    }
    
    if(USART4_GPIO_Flag == false)
    {
      USART4_GPIO_Flag = true;
      
      RCC_AHB1PeriphClockCmd(USART4_Tx_RCC_AHB1Periph_GPIO, ENABLE);  /* Enable USART4_Tx GPIO clock */
      RCC_AHB1PeriphClockCmd(USART4_Rx_RCC_AHB1Periph_GPIO, ENABLE);  /* Enable USART4_Rx GPIO clock */
      
      GPIO_PinAFConfig(USART4_Tx_GPIO, USART4_Tx_GPIO_PinSource, GPIO_AF_UART4);  /* Connect GPIOxn to USART4_Tx */
      GPIO_PinAFConfig(USART4_Rx_GPIO, USART4_Rx_GPIO_PinSource, GPIO_AF_UART4);  /* Connect GPIOxn to USART4_Rx */
      
      GPIO_InitStructure.GPIO_Pin = USART4_Tx_GPIO_Pin;   /* Specifies the GPIO pins to be configured. */
      GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;        /* Specifies the operating mode for the selected pins. */
      GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;  /* Specifies the speed for the selected pins. */
      GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;      /* Specifies the operating output type for the selected pins. */
      GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;        /* Specifies the operating Pull-up/Pull down for the selected pins. */
      GPIO_Init(USART4_Tx_GPIO, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
      
      GPIO_InitStructure.GPIO_Pin = USART4_Rx_GPIO_Pin;   /* Specifies the GPIO pins to be configured. */
      GPIO_Init(USART4_Rx_GPIO, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
    }
#else
    return;
#endif /* (USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx) || (USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx) */
  }
  else if(USARTx == UART5)
  {
#if (USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx) || (USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx)
#if USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx
    USART_Mode          |= USART_Mode_Tx;
    USART5_SendData_Flag = false;
    USART5_SendData_P    = NULL;
#endif /* USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx */
    
#if USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx
    USART_Mode          |= USART_Mode_Rx;
    USART5_ReceiveData_P = NULL;
#endif /* USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx */
    
    if(USART5_RCC_Flag == false)
    {
      USART5_RCC_Flag = true;
      
