XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
    if(USART1_RCC_Flag == true)
    {
      USART1_RCC_Flag = false;
      
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, DISABLE); /* Disable USART1 clock */
      
      USART_DeInit(USART1); /* Deinitializes the USART1 peripheral registers to their default reset values. */
      
      USART_DMA_TX_Unconfigure(USART1); /* Unconfigure USART1 DMA TX */
      USART_DMA_RX_Unconfigure(USART1); /* Unconfigure USART1 DMA RX */
      
      USART_NVIC_Unconfigure(USART1);   /* Unconfigure USART1 NVIC */
    }
#endif /* (USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx) || (USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx) */
  }
  else if(USARTx == USART2)
  {
#if (USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx) || (USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx)
#if USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx
    USART2_SendData_Flag = false;
    USART2_SendData_P    = NULL;
#endif /* USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx */
    
#if USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx
    USART2_ReceiveData_P = NULL;
#endif /* USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx */
    
    if(USART2_RCC_Flag == true)
    {
      USART2_RCC_Flag = false;
      
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, DISABLE); /* Disable USART2 clock */
      
      USART_DeInit(USART2); /* Deinitializes the USART2 peripheral registers to their default reset values. */
      
      USART_DMA_TX_Unconfigure(USART2); /* Unconfigure USART2 DMA TX */
      USART_DMA_RX_Unconfigure(USART2); /* Unconfigure USART2 DMA RX */
      
      USART_NVIC_Unconfigure(USART2);   /* Unconfigure USART2 NVIC */
    }
#endif /* (USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx) || (USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx) */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if (USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx) || (USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx)
#if USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx
    USART3_SendData_Flag = false;
    USART3_SendData_P    = NULL;
#endif /* USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx */
    
#if USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx
    USART3_ReceiveData_P = NULL;
#endif /* USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx */
    
    if(USART3_RCC_Flag == true)
    {
      USART3_RCC_Flag = false;
      
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, DISABLE); /* Disable USART3 clock */
      
      USART_DeInit(USART3); /* Deinitializes the USART3 peripheral registers to their default reset values. */
      
      USART_DMA_TX_Unconfigure(USART3); /* Unconfigure USART3 DMA TX */
      USART_DMA_RX_Unconfigure(USART3); /* Unconfigure USART3 DMA RX */
      
      USART_NVIC_Unconfigure(USART3);   /* Unconfigure USART3 NVIC */
    }
#endif /* (USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx) || (USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx) */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if (USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx) || (USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx)
#if USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx
    USART4_SendData_Flag = false;
    USART4_SendData_P    = NULL;
#endif /* USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx */
    
#if USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx
    USART4_ReceiveData_P = NULL;
#endif /* USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx */
    
    if(USART4_RCC_Flag == true)
    {
      USART4_RCC_Flag = false;
      
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, DISABLE);  /* Disable USART4 clock */
      
      USART_DeInit(UART4);  /* Deinitializes the USART4 peripheral registers to their default reset values. */
      
      USART_DMA_TX_Unconfigure(UART4);  /* Unconfigure USART4 DMA TX */
      USART_DMA_RX_Unconfigure(UART4);  /* Unconfigure USART4 DMA RX */
      
      USART_NVIC_Unconfigure(UART4);    /* Unconfigure USART4 NVIC */
    }
#endif /* (USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx) || (USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx) */
  }
  else if(USARTx == UART5)
  {
#if (USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx) || (USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx)
#if USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx
    USART5_SendData_Flag = false;
    USART5_SendData_P    = NULL;
#endif /* USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx */
    
#if USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx
    USART5_ReceiveData_P = NULL;
#endif /* USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx */
    
    if(USART5_RCC_Flag == true)
    {
      USART5_RCC_Flag = false;
      
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, DISABLE);  /* Disable USART5 clock */
      
      USART_DeInit(UART5);  /* Deinitializes the USART5 peripheral registers to their default reset values. */
      
      USART_DMA_TX_Unconfigure(UART5);  /* Unconfigure USART5 DMA TX */
      USART_DMA_RX_Unconfigure(UART5);  /* Unconfigure USART5 DMA RX */
      
      USART_NVIC_Unconfigure(UART5);    /* Unconfigure USART5 NVIC */
    }
#endif /* (USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx) || (USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx) */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if (USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx) || (USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx)
#if USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx
    USART6_SendData_Flag = false;
    USART6_SendData_P    = NULL;
#endif /* USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx */
    
#if USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx
    USART6_ReceiveData_P = NULL;
#endif /* USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx */
    
    if(USART6_RCC_Flag == true)
    {
      USART6_RCC_Flag = false;
      
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART6, DISABLE); /* Disable USART6 clock */
      
      USART_DeInit(USART6); /* Deinitializes the USART6 peripheral registers to their default reset values. */
      
      USART_DMA_TX_Unconfigure(USART6); /* Unconfigure USART6 DMA TX */
      USART_DMA_RX_Unconfigure(USART6); /* Unconfigure USART6 DMA RX */
      
      USART_NVIC_Unconfigure(USART6);   /* Unconfigure USART6 NVIC */
    }
#endif /* (USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx) || (USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx) */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if (USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx) || (USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx)
#if USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx
    USART7_SendData_Flag = false;
    USART7_SendData_P    = NULL;
#endif /* USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx */
    
#if USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx
    USART7_ReceiveData_P = NULL;
#endif /* USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx */
    
    if(USART7_RCC_Flag == true)
    {
      USART7_RCC_Flag = false;
      
