XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
    DMA_InitStructure.DMA_Channel = DMA_Channel_5;                          /* Channel selection */
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&UART8->DR);      /* Set the DMA source: peripheral data register address */
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)USART8_DMA_Buffer_Tx; /* Memory address */
    DMA_InitStructure.DMA_BufferSize = USART8_DMA_BufferSize_Tx;            /* Specifies the DMA channel DMA buffer size */
    
    DMA_DeInit(DMA1_Stream0);                         /* Deinitialize the DMA1 Stream0 registers to their default reset values. */
    while(DMA_GetCmdStatus(DMA1_Stream0) != DISABLE); /* Wait for the specified DMA1 Stream0 reset to complete. */
    
    DMA_Init(DMA1_Stream0, &DMA_InitStructure); /* Initializes the DMA1 Stream0. */
    DMA_Cmd(DMA1_Stream0, DISABLE);             /* Disables the specified DMA1 Stream0. */
#endif /* USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx
    USART9_DMA_Tx_Flag = true;
    
    DMA_InitStructure.DMA_Channel = DMA_Channel_1;                          /* Channel selection */
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&UART9->DR);      /* Set the DMA source: peripheral data register address */
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)USART9_DMA_Buffer_Tx; /* Memory address */
    DMA_InitStructure.DMA_BufferSize = USART9_DMA_BufferSize_Tx;            /* Specifies the DMA channel DMA buffer size */
    
    DMA_DeInit(DMA2_Stream0);                         /* Deinitialize the DMA2 Stream0 registers to their default reset values. */
    while(DMA_GetCmdStatus(DMA2_Stream0) != DISABLE); /* Wait for the specified DMA2 Stream0 reset to complete. */
    
    DMA_Init(DMA2_Stream0, &DMA_InitStructure); /* Initializes the DMA2 Stream0. */
    DMA_Cmd(DMA2_Stream0, DISABLE);             /* Disables the specified DMA2 Stream0. */
#endif /* USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx
    USART10_DMA_Tx_Flag = true;
    
    DMA_InitStructure.DMA_Channel = DMA_Channel_6;                            /* Channel selection */
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&UART10->DR);       /* Set the DMA source: peripheral data register address */
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)USART10_DMA_Buffer_Tx;  /* Memory address */
    DMA_InitStructure.DMA_BufferSize = USART10_DMA_BufferSize_Tx;             /* Specifies the DMA channel DMA buffer size */
    
    DMA_DeInit(DMA2_Stream7);                         /* Deinitialize the DMA2 Stream7 registers to their default reset values. */
    while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE); /* Wait for the specified DMA2 Stream7 reset to complete. */
    
    DMA_Init(DMA2_Stream7, &DMA_InitStructure); /* Initializes the DMA2 Stream7. */
    DMA_Cmd(DMA2_Stream7, DISABLE);             /* Disables the specified DMA2 Stream7. */
#endif /* USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx */
  }
#endif /* STM32F413_423xx */
}

/****************************************************************
 * Function:    USART_DMA_RX_Configure
 * Description: DMA RX configure.
 * Input:       USARTx: Where x can be 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 to select the USART or UART peripheral.
 * Output:
 * Return:
*****************************************************************/
static void USART_DMA_RX_Configure(USART_TypeDef* USARTx)
{
  DMA_InitTypeDef DMA_InitStructure = {NULL}; /* DMA Init structure definition */
  
  if((USARTx == USART2)
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
     || (USARTx == USART3)
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
     || (USARTx == UART4) || (USARTx == UART5)
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
     || (USARTx == UART7) || (USARTx == UART8)
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
    )
  {
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA1, ENABLE);  /* Enable DMA1 clock */
  }
  else if((USARTx == USART1) || (USARTx == USART6)
#if defined(STM32F413_423xx)
          || (USARTx == UART9) || (USARTx == UART10)
#endif /* STM32F413_423xx */
         )
  {
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);  /* Enable DMA2 clock */
  }

  DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;                 /* Data Peripheral to Memory */
  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;        /* Peripheral address does not increase */
  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;                 /* Memory address increment */
  DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte; /* Peripheral data width of 8 bit */
  DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;         /* Memory data width of 8 bit */
  DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;                         /* Use Circular mode */
  DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;                   /* Medium priority */
  DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;                  /* FIFO mode disabled */
  DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;           /* Specifies the FIFO threshold level */
  DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;             /* A single transmission burst memory */
  DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;     /* Peripherals single transmission burst */

  if(USARTx == USART1)
  {
#if USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx
    USART1_DMA_Rx_Flag = true;
    
    DMA_InitStructure.DMA_Channel = DMA_Channel_4;                          /* Channel selection */
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&USART1->DR);     /* Set the DMA source: peripheral data register address */
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)USART1_DMA_Buffer_Rx; /* Memory address */
    DMA_InitStructure.DMA_BufferSize = USART1_DMA_BufferSize_Rx;            /* Specifies the DMA channel DMA buffer size */
    
    DMA_DeInit(DMA2_Stream2);                         /* Deinitialize the DMA2 Stream2 registers to their default reset values. */
    while(DMA_GetCmdStatus(DMA2_Stream2) != DISABLE); /* Wait for the specified DMA2 Stream2 reset to complete. */
    
    DMA_Init(DMA2_Stream2, &DMA_InitStructure); /* Initializes the DMA2 Stream2. */
    DMA_Cmd(DMA2_Stream2, ENABLE);              /* Enables the specified DMA2 Stream2. */
#endif /* USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx
    USART2_DMA_Rx_Flag = true;
    
    DMA_InitStructure.DMA_Channel = DMA_Channel_4;                          /* Channel selection */
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&USART2->DR);     /* Set the DMA source: peripheral data register address */
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)USART2_DMA_Buffer_Rx; /* Memory address */
    DMA_InitStructure.DMA_BufferSize = USART2_DMA_BufferSize_Rx;            /* Specifies the DMA channel DMA buffer size */
    
    DMA_DeInit(DMA1_Stream5);                         /* Deinitialize the DMA1 Stream5 registers to their default reset values. */
    while(DMA_GetCmdStatus(DMA1_Stream5) != DISABLE); /* Wait for the specified DMA1 Stream5 reset to complete. */
    
