XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
    DMA_InitStructure.DMA_Channel = DMA_Channel_5;                          /* Channel selection */
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&UART8->DR);      /* Set the DMA source: peripheral data register address */
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)USART8_DMA_Buffer_Rx; /* Memory address */
    DMA_InitStructure.DMA_BufferSize = USART8_DMA_BufferSize_Rx;            /* Specifies the DMA channel DMA buffer size */
    
    DMA_DeInit(DMA1_Stream6);                         /* Deinitialize the DMA1 Stream6 registers to their default reset values. */
    while(DMA_GetCmdStatus(DMA1_Stream6) != DISABLE); /* Wait for the specified DMA1 Stream6 reset to complete. */
    
    DMA_Init(DMA1_Stream6, &DMA_InitStructure); /* Initializes the DMA1 Stream6. */
    DMA_Cmd(DMA1_Stream6, ENABLE);              /* Enables the specified DMA1 Stream6. */
#endif /* USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx
    USART9_DMA_Rx_Flag = true;
    
    DMA_InitStructure.DMA_Channel = DMA_Channel_0;                          /* Channel selection */
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&UART9->DR);      /* Set the DMA source: peripheral data register address */
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)USART9_DMA_Buffer_Rx; /* Memory address */
    DMA_InitStructure.DMA_BufferSize = USART9_DMA_BufferSize_Rx;            /* Specifies the DMA channel DMA buffer size */
    
    DMA_DeInit(DMA2_Stream7);                         /* Deinitialize the DMA2 Stream7 registers to their default reset values. */
    while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE); /* Wait for the specified DMA2 Stream7 reset to complete. */
    
    DMA_Init(DMA2_Stream7, &DMA_InitStructure); /* Initializes the DMA2 Stream7. */
    DMA_Cmd(DMA2_Stream7, ENABLE);              /* Enables the specified DMA2 Stream7. */
#endif /* USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx
    USART10_DMA_Rx_Flag = true;
    
    DMA_InitStructure.DMA_Channel = DMA_Channel_5;                            /* Channel selection */
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&UART10->DR);       /* Set the DMA source: peripheral data register address */
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)USART10_DMA_Buffer_Rx;  /* Memory address */
    DMA_InitStructure.DMA_BufferSize = USART10_DMA_BufferSize_Rx;             /* Specifies the DMA channel DMA buffer size */
    
    DMA_DeInit(DMA2_Stream0);                         /* Deinitialize the DMA2 Stream0 registers to their default reset values. */
    while(DMA_GetCmdStatus(DMA2_Stream0) != DISABLE); /* Wait for the specified DMA2 Stream0 reset to complete. */
    
    DMA_Init(DMA2_Stream0, &DMA_InitStructure); /* Initializes the DMA2 Stream0. */
    DMA_Cmd(DMA2_Stream0, ENABLE);              /* Enables the specified DMA2 Stream0. */
#endif /* USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx */
  }
#endif /* STM32F413_423xx */
}

/****************************************************************
 * Function:    USART_DMA_TX_Unconfigure
 * Description: DMA TX unconfigure.
 * Input:       USARTx: Where x can be 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 to select the USART or UART peripheral.
 * Output:
 * Return:
*****************************************************************/
static void USART_DMA_TX_Unconfigure(USART_TypeDef* USARTx)
{
  if(USARTx == USART1)
  {
#if USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx
    if(USART1_DMA_Tx_Flag == true)
    {
      USART1_DMA_Tx_Flag = false;
      
      DMA_DeInit(DMA2_Stream7);                         /* Deinitialize the DMA2 Stream7 registers to their default reset values. */
      while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE); /* Wait for the specified DMA2 Stream7 reset to complete. */
    }
#endif /* USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx
    if(USART2_DMA_Tx_Flag == true)
    {
      USART2_DMA_Tx_Flag = false;
      
      DMA_DeInit(DMA1_Stream6);                         /* Deinitialize the DMA1 Stream6 registers to their default reset values. */
      while(DMA_GetCmdStatus(DMA1_Stream6) != DISABLE); /* Wait for the specified DMA1 Stream6 reset to complete. */
    }
#endif /* USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx
    if(USART3_DMA_Tx_Flag == true)
    {
      USART3_DMA_Tx_Flag = false;
      
      DMA_DeInit(DMA1_Stream3);                         /* Deinitialize the DMA1 Stream3 registers to their default reset values. */
      while(DMA_GetCmdStatus(DMA1_Stream3) != DISABLE); /* Wait for the specified DMA1 Stream3 reset to complete. */
    }
#endif /* USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx
    if(USART4_DMA_Tx_Flag == true)
    {
      USART4_DMA_Tx_Flag = false;
      
      DMA_DeInit(DMA1_Stream4);                         /* Deinitialize the DMA1 Stream4 registers to their default reset values. */
      while(DMA_GetCmdStatus(DMA1_Stream4) != DISABLE); /* Wait for the specified DMA1 Stream4 reset to complete. */
    }
#endif /* USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx
    if(USART5_DMA_Tx_Flag == true)
    {
      USART5_DMA_Tx_Flag = false;
      
      DMA_DeInit(DMA1_Stream7);                         /* Deinitialize the DMA1 Stream7 registers to their default reset values. */
      while(DMA_GetCmdStatus(DMA1_Stream7) != DISABLE); /* Wait for the specified DMA1 Stream7 reset to complete. */
    }
#endif /* USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx
    if(USART6_DMA_Tx_Flag == true)
    {
      USART6_DMA_Tx_Flag = false;
      
      DMA_DeInit(DMA2_Stream6);                         /* Deinitialize the DMA2 Stream6 registers to their default reset values. */
      while(DMA_GetCmdStatus(DMA2_Stream6) != DISABLE); /* Wait for the specified DMA2 Stream6 reset to complete. */
    }
#endif /* USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx
    if(USART7_DMA_Tx_Flag == true)
    {
      USART7_DMA_Tx_Flag = false;
      
      DMA_DeInit(DMA1_Stream1);                         /* Deinitialize the DMA1 Stream1 registers to their default reset values. */
      while(DMA_GetCmdStatus(DMA1_Stream1) != DISABLE); /* Wait for the specified DMA1 Stream1 reset to complete. */
    }
#endif /* USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx
    if(USART8_DMA_Tx_Flag == true)
    {
      USART8_DMA_Tx_Flag = false;
      
