XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
      NVIC_InitStructure.NVIC_IRQChannel = UART7_IRQn;                                      /* Specifies the IRQ channel to be enabled or disabled. */
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART7_IRQ_PreemptionPriority; /* Specifies the pre-emption priority for the IRQ channel specified in NVIC_IRQChannel. */
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART7_IRQ_SubPriority;               /* Specifies the subpriority level for the IRQ channel specified in NVIC_IRQChannel. */
      NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;                                       /* Specifies whether the IRQ channel defined in NVIC_IRQChannel will be enabled or disabled. */
      NVIC_Init(&NVIC_InitStructure);                                                       /* Initializes the NVIC peripheral according to the specified parameters in the NVIC_InitStruct. */
    }
#endif /* (USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx) || (USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx) */
  }
  else if(USARTx == UART8)
  {
#if (USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx) || (USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx)
    if(USART8_NVIC_Flag == false)
    {
      USART8_NVIC_Flag = true;
      
      NVIC_InitStructure.NVIC_IRQChannel = UART8_IRQn;                                      /* Specifies the IRQ channel to be enabled or disabled. */
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART8_IRQ_PreemptionPriority; /* Specifies the pre-emption priority for the IRQ channel specified in NVIC_IRQChannel. */
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART8_IRQ_SubPriority;               /* Specifies the subpriority level for the IRQ channel specified in NVIC_IRQChannel. */
      NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;                                       /* Specifies whether the IRQ channel defined in NVIC_IRQChannel will be enabled or disabled. */
      NVIC_Init(&NVIC_InitStructure);                                                       /* Initializes the NVIC peripheral according to the specified parameters in the NVIC_InitStruct. */
    }
#endif /* (USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx) || (USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx) */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if (USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx) || (USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx)
    if(USART9_NVIC_Flag == false)
    {
      USART9_NVIC_Flag = true;
      
      NVIC_InitStructure.NVIC_IRQChannel = UART9_IRQn;                                      /* Specifies the IRQ channel to be enabled or disabled. */
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART9_IRQ_PreemptionPriority; /* Specifies the pre-emption priority for the IRQ channel specified in NVIC_IRQChannel. */
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART9_IRQ_SubPriority;               /* Specifies the subpriority level for the IRQ channel specified in NVIC_IRQChannel. */
      NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;                                       /* Specifies whether the IRQ channel defined in NVIC_IRQChannel will be enabled or disabled. */
      NVIC_Init(&NVIC_InitStructure);                                                       /* Initializes the NVIC peripheral according to the specified parameters in the NVIC_InitStruct. */
    }
#endif /* (USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx) || (USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx) */
  }
  else if(USARTx == UART10)
  {
#if (USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx) || (USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx)
    if(USART10_NVIC_Flag == false)
    {
      USART10_NVIC_Flag = true;
      
      NVIC_InitStructure.NVIC_IRQChannel = UART10_IRQn;                                       /* Specifies the IRQ channel to be enabled or disabled. */
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART10_IRQ_PreemptionPriority;  /* Specifies the pre-emption priority for the IRQ channel specified in NVIC_IRQChannel. */
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART10_IRQ_SubPriority;                /* Specifies the subpriority level for the IRQ channel specified in NVIC_IRQChannel. */
      NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;                                         /* Specifies whether the IRQ channel defined in NVIC_IRQChannel will be enabled or disabled. */
      NVIC_Init(&NVIC_InitStructure);                                                         /* Initializes the NVIC peripheral according to the specified parameters in the NVIC_InitStruct. */
    }
#endif /* (USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx) || (USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx) */
  }
#endif /* STM32F413_423xx */
}

/****************************************************************
 * Function:    USART_NVIC_Unconfigure
 * Description: NVIC unconfigure.
 * Input:       USARTx: Where x can be 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 to select the USART or UART peripheral.
 * Output:
 * Return:
*****************************************************************/
static void USART_NVIC_Unconfigure(USART_TypeDef* USARTx)
{
  NVIC_InitTypeDef NVIC_InitStructure = {NULL}; /* NVIC Init Structure definition */
  
  if(USARTx == USART1)
  {
#if (USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx) || (USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx)
    if(USART1_NVIC_Flag == true)
    {
      USART1_NVIC_Flag = false;
      
      NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;                                     /* Specifies the IRQ channel to be enabled or disabled. */
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART1_IRQ_PreemptionPriority; /* Specifies the pre-emption priority for the IRQ channel specified in NVIC_IRQChannel. */
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART1_IRQ_SubPriority;               /* Specifies the subpriority level for the IRQ channel specified in NVIC_IRQChannel. */
      NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;                                      /* Specifies whether the IRQ channel defined in NVIC_IRQChannel will be enabled or disabled. */
      NVIC_Init(&NVIC_InitStructure);                                                       /* Initializes the NVIC peripheral according to the specified parameters in the NVIC_InitStruct. */
    }
#endif /* (USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx) || (USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx) */
  }
  else if(USARTx == USART2)
  {
#if (USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx) || (USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx)
    if(USART2_NVIC_Flag == true)
    {
      USART2_NVIC_Flag = false;
      
