XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
      NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn;                                     /* Specifies the IRQ channel to be enabled or disabled. */
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART2_IRQ_PreemptionPriority; /* Specifies the pre-emption priority for the IRQ channel specified in NVIC_IRQChannel. */
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART2_IRQ_SubPriority;               /* Specifies the subpriority level for the IRQ channel specified in NVIC_IRQChannel. */
      NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;                                      /* Specifies whether the IRQ channel defined in NVIC_IRQChannel will be enabled or disabled. */
      NVIC_Init(&NVIC_InitStructure);                                                       /* Initializes the NVIC peripheral according to the specified parameters in the NVIC_InitStruct. */
    }
#endif /* (USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx) || (USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx) */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if (USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx) || (USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx)
    if(USART3_NVIC_Flag == true)
    {
      USART3_NVIC_Flag = false;
      
      NVIC_InitStructure.NVIC_IRQChannel = USART3_IRQn;                                     /* Specifies the IRQ channel to be enabled or disabled. */
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART3_IRQ_PreemptionPriority; /* Specifies the pre-emption priority for the IRQ channel specified in NVIC_IRQChannel. */
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART3_IRQ_SubPriority;               /* Specifies the subpriority level for the IRQ channel specified in NVIC_IRQChannel. */
      NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;                                      /* Specifies whether the IRQ channel defined in NVIC_IRQChannel will be enabled or disabled. */
      NVIC_Init(&NVIC_InitStructure);                                                       /* Initializes the NVIC peripheral according to the specified parameters in the NVIC_InitStruct. */
    }
#endif /* (USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx) || (USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx) */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if (USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx) || (USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx)
    if(USART4_NVIC_Flag == true)
    {
      USART4_NVIC_Flag = false;
      
      NVIC_InitStructure.NVIC_IRQChannel = UART4_IRQn;                                      /* Specifies the IRQ channel to be enabled or disabled. */
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART4_IRQ_PreemptionPriority; /* Specifies the pre-emption priority for the IRQ channel specified in NVIC_IRQChannel. */
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART4_IRQ_SubPriority;               /* Specifies the subpriority level for the IRQ channel specified in NVIC_IRQChannel. */
      NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;                                      /* Specifies whether the IRQ channel defined in NVIC_IRQChannel will be enabled or disabled. */
      NVIC_Init(&NVIC_InitStructure);                                                       /* Initializes the NVIC peripheral according to the specified parameters in the NVIC_InitStruct. */
    }
#endif /* (USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx) || (USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx) */
  }
  else if(USARTx == UART5)
  {
#if (USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx) || (USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx)
    if(USART5_NVIC_Flag == true)
    {
      USART5_NVIC_Flag = false;
      
      NVIC_InitStructure.NVIC_IRQChannel = UART5_IRQn;                                      /* Specifies the IRQ channel to be enabled or disabled. */
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART5_IRQ_PreemptionPriority; /* Specifies the pre-emption priority for the IRQ channel specified in NVIC_IRQChannel. */
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART5_IRQ_SubPriority;               /* Specifies the subpriority level for the IRQ channel specified in NVIC_IRQChannel. */
      NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;                                      /* Specifies whether the IRQ channel defined in NVIC_IRQChannel will be enabled or disabled. */
      NVIC_Init(&NVIC_InitStructure);                                                       /* Initializes the NVIC peripheral according to the specified parameters in the NVIC_InitStruct. */
    }
#endif /* (USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx) || (USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx) */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if (USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx) || (USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx)
    if(USART6_NVIC_Flag == true)
    {
      USART6_NVIC_Flag = false;
      
      NVIC_InitStructure.NVIC_IRQChannel = USART6_IRQn;                                     /* Specifies the IRQ channel to be enabled or disabled. */
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART6_IRQ_PreemptionPriority; /* Specifies the pre-emption priority for the IRQ channel specified in NVIC_IRQChannel. */
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART6_IRQ_SubPriority;               /* Specifies the subpriority level for the IRQ channel specified in NVIC_IRQChannel. */
      NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;                                      /* Specifies whether the IRQ channel defined in NVIC_IRQChannel will be enabled or disabled. */
      NVIC_Init(&NVIC_InitStructure);                                                       /* Initializes the NVIC peripheral according to the specified parameters in the NVIC_InitStruct. */
    }
#endif /* (USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx) || (USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx) */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if (USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx) || (USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx)
    if(USART7_NVIC_Flag == true)
    {
      USART7_NVIC_Flag = false;
      
