XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
        USART1_SendDataCount += USART1_SendData_P;
        USART1_SendData_P     = NULL;
      }
    }
    
    return Length;
#endif /* USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx
    if((USART2_RCC_Flag == false) || (USART2_GPIO_Flag == false) || (USART2_DMA_Tx_Flag == false) || (USART2_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART2_SendData_P >= USART2_BufferSize_Tx)
    {
      return NULL;
    }
    
    if(Length > (USART2_BufferSize_Tx - USART2_SendData_P))
    {
      memcpy(USART2_Buffer_Tx + USART2_SendData_P, Data, USART2_BufferSize_Tx - USART2_SendData_P);
      
      USART2_SendData_P = USART2_BufferSize_Tx;
      Length            = USART2_BufferSize_Tx - USART2_SendData_P;
    }
    else
    {
      memcpy(USART2_Buffer_Tx + USART2_SendData_P, Data, Length);
      
      USART2_SendData_P += Length;
    }
    
    if(USART2_SendData_Flag == false)
    {
      USART2_SendData_Flag = true;
      
      if(USART2_SendData_P > USART2_DMA_BufferSize_Tx)
      {
        memcpy(USART2_DMA_Buffer_Tx, USART2_Buffer_Tx, USART2_DMA_BufferSize_Tx);
        memmove(USART2_Buffer_Tx, USART2_Buffer_Tx + USART2_DMA_BufferSize_Tx, USART2_SendData_P - USART2_DMA_BufferSize_Tx);
        
        DMA_ClearFlag(DMA1_Stream6, DMA_FLAG_TCIF6);                    /* Clears the DMA1 Stream6's pending flags. */
        DMA_Cmd(DMA1_Stream6, DISABLE);                                 /* Disables the specified DMA1 Stream6. */
        while(DMA_GetCmdStatus(DMA1_Stream6) != DISABLE);               /* Wait for the specified DMA1 Stream6 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream6, USART2_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream6. */
        DMA_Cmd(DMA1_Stream6, ENABLE);                                  /* Enables the specified DMA1 Stream6. */
        
        USART2_SendDataCount += USART2_DMA_BufferSize_Tx;
        USART2_SendData_P    -= USART2_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART2_DMA_Buffer_Tx, USART2_Buffer_Tx, USART2_SendData_P);
        
        DMA_ClearFlag(DMA1_Stream6, DMA_FLAG_TCIF6);              /* Clears the DMA1 Stream6's pending flags. */
        DMA_Cmd(DMA1_Stream6, DISABLE);                           /* Disables the specified DMA1 Stream6. */
        while(DMA_GetCmdStatus(DMA1_Stream6) != DISABLE);         /* Wait for the specified DMA1 Stream6 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream6, USART2_SendData_P);  /* Writes the number of data units to be transferred on the DMA1 Stream6. */
        DMA_Cmd(DMA1_Stream6, ENABLE);                            /* Enables the specified DMA1 Stream6. */
        
        USART2_SendDataCount += USART2_SendData_P;
        USART2_SendData_P     = NULL;
      }
    }
    
    return Length;
#endif /* USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx
    if((USART3_RCC_Flag == false) || (USART3_GPIO_Flag == false) || (USART3_DMA_Tx_Flag == false) || (USART3_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART3_SendData_P >= USART3_BufferSize_Tx)
    {
      return NULL;
    }
    
    if(Length > (USART3_BufferSize_Tx - USART3_SendData_P))
    {
      memcpy(USART3_Buffer_Tx + USART3_SendData_P, Data, USART3_BufferSize_Tx - USART3_SendData_P);
      
      USART3_SendData_P = USART3_BufferSize_Tx;
      Length            = USART3_BufferSize_Tx - USART3_SendData_P;
    }
    else
    {
      memcpy(USART3_Buffer_Tx + USART3_SendData_P, Data, Length);
      
      USART3_SendData_P += Length;
    }
    
    if(USART3_SendData_Flag == false)
    {
      USART3_SendData_Flag = true;
      
      if(USART3_SendData_P > USART3_DMA_BufferSize_Tx)
      {
        memcpy(USART3_DMA_Buffer_Tx, USART3_Buffer_Tx, USART3_DMA_BufferSize_Tx);
        memmove(USART3_Buffer_Tx, USART3_Buffer_Tx + USART3_DMA_BufferSize_Tx, USART3_SendData_P - USART3_DMA_BufferSize_Tx);
        
        DMA_ClearFlag(DMA1_Stream3, DMA_FLAG_TCIF3);                    /* Clears the DMA1 Stream3's pending flags. */
        DMA_Cmd(DMA1_Stream3, DISABLE);                                 /* Disables the specified DMA1 Stream3. */
        while(DMA_GetCmdStatus(DMA1_Stream3) != DISABLE);               /* Wait for the specified DMA1 Stream3 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream3, USART3_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream3. */
        DMA_Cmd(DMA1_Stream3, ENABLE);                                  /* Enables the specified DMA1 Stream3. */
        
        USART3_SendDataCount += USART3_DMA_BufferSize_Tx;
        USART3_SendData_P    -= USART3_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART3_DMA_Buffer_Tx, USART3_Buffer_Tx, USART3_SendData_P);
        
        DMA_ClearFlag(DMA1_Stream3, DMA_FLAG_TCIF3);              /* Clears the DMA1 Stream3's pending flags. */
        DMA_Cmd(DMA1_Stream3, DISABLE);                           /* Disables the specified DMA1 Stream3. */
        while(DMA_GetCmdStatus(DMA1_Stream3) != DISABLE);         /* Wait for the specified DMA1 Stream3 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream3, USART3_SendData_P);  /* Writes the number of data units to be transferred on the DMA1 Stream3. */
        DMA_Cmd(DMA1_Stream3, ENABLE);                            /* Enables the specified DMA1 Stream3. */
        
        USART3_SendDataCount += USART3_SendData_P;
        USART3_SendData_P     = NULL;
      }
    }
    
    return Length;
#endif /* USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx
    if((USART4_RCC_Flag == false) || (USART4_GPIO_Flag == false) || (USART4_DMA_Tx_Flag == false) || (USART4_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART4_SendData_P >= USART4_BufferSize_Tx)
    {
      return NULL;
    }
    
    if(Length > (USART4_BufferSize_Tx - USART4_SendData_P))
    {
      memcpy(USART4_Buffer_Tx + USART4_SendData_P, Data, USART4_BufferSize_Tx - USART4_SendData_P);
      
      USART4_SendData_P = USART4_BufferSize_Tx;
      Length            = USART4_BufferSize_Tx - USART4_SendData_P;
    }
    else
    {
      memcpy(USART4_Buffer_Tx + USART4_SendData_P, Data, Length);
      
