XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
    return Length;
#endif /* USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx
    if((USART7_RCC_Flag == false) || (USART7_GPIO_Flag == false) || (USART7_DMA_Tx_Flag == false) || (USART7_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART7_SendData_P >= USART7_BufferSize_Tx)
    {
      return NULL;
    }
    
    if(Length > (USART7_BufferSize_Tx - USART7_SendData_P))
    {
      memcpy(USART7_Buffer_Tx + USART7_SendData_P, Data, USART7_BufferSize_Tx - USART7_SendData_P);
      
      USART7_SendData_P = USART7_BufferSize_Tx;
      Length            = USART7_BufferSize_Tx - USART7_SendData_P;
    }
    else
    {
      memcpy(USART7_Buffer_Tx + USART7_SendData_P, Data, Length);
      
      USART7_SendData_P += Length;
    }
    
    if(USART7_SendData_Flag == false)
    {
      USART7_SendData_Flag = true;
      
      if(USART7_SendData_P > USART7_DMA_BufferSize_Tx)
      {
        memcpy(USART7_DMA_Buffer_Tx, USART7_Buffer_Tx, USART7_DMA_BufferSize_Tx);
        memmove(USART7_Buffer_Tx, USART7_Buffer_Tx + USART7_DMA_BufferSize_Tx, USART7_SendData_P - USART7_DMA_BufferSize_Tx);
        
        DMA_ClearFlag(DMA1_Stream1, DMA_FLAG_TCIF1);                    /* Clears the DMA1 Stream1's pending flags. */
        DMA_Cmd(DMA1_Stream1, DISABLE);                                 /* Disables the specified DMA1 Stream1. */
        while(DMA_GetCmdStatus(DMA1_Stream1) != DISABLE);               /* Wait for the specified DMA1 Stream1 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream1, USART7_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream1. */
        DMA_Cmd(DMA1_Stream1, ENABLE);                                  /* Enables the specified DMA1 Stream1. */
        
        USART7_SendDataCount += USART7_DMA_BufferSize_Tx;
        USART7_SendData_P    -= USART7_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART7_DMA_Buffer_Tx, USART7_Buffer_Tx, USART7_SendData_P);
        
        DMA_ClearFlag(DMA1_Stream1, DMA_FLAG_TCIF1);              /* Clears the DMA1 Stream1's pending flags. */
        DMA_Cmd(DMA1_Stream1, DISABLE);                           /* Disables the specified DMA1 Stream1. */
        while(DMA_GetCmdStatus(DMA1_Stream1) != DISABLE);         /* Wait for the specified DMA1 Stream1 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream1, USART7_SendData_P);  /* Writes the number of data units to be transferred on the DMA1 Stream1. */
        DMA_Cmd(DMA1_Stream1, ENABLE);                            /* Enables the specified DMA1 Stream1. */
        
        USART7_SendDataCount += USART7_SendData_P;
        USART7_SendData_P     = NULL;
      }
    }
    
    return Length;
#endif /* USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx
    if((USART8_RCC_Flag == false) || (USART8_GPIO_Flag == false) || (USART8_DMA_Tx_Flag == false) || (USART8_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART8_SendData_P >= USART8_BufferSize_Tx)
    {
      return NULL;
    }
    
    if(Length > (USART8_BufferSize_Tx - USART8_SendData_P))
    {
      memcpy(USART8_Buffer_Tx + USART8_SendData_P, Data, USART8_BufferSize_Tx - USART8_SendData_P);
      
      USART8_SendData_P = USART8_BufferSize_Tx;
      Length            = USART8_BufferSize_Tx - USART8_SendData_P;
    }
    else
    {
      memcpy(USART8_Buffer_Tx + USART8_SendData_P, Data, Length);
      
      USART8_SendData_P += Length;
    }
    
    if(USART8_SendData_Flag == false)
    {
      USART8_SendData_Flag = true;
      
      if(USART8_SendData_P > USART8_DMA_BufferSize_Tx)
      {
        memcpy(USART8_DMA_Buffer_Tx, USART8_Buffer_Tx, USART8_DMA_BufferSize_Tx);
        memmove(USART8_Buffer_Tx, USART8_Buffer_Tx + USART8_DMA_BufferSize_Tx, USART8_SendData_P - USART8_DMA_BufferSize_Tx);
        
        DMA_ClearFlag(DMA1_Stream0, DMA_FLAG_TCIF0);                    /* Clears the DMA1 Stream0's pending flags. */
        DMA_Cmd(DMA1_Stream0, DISABLE);                                 /* Disables the specified DMA1 Stream0. */
        while(DMA_GetCmdStatus(DMA1_Stream0) != DISABLE);               /* Wait for the specified DMA1 Stream0 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream0, USART8_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream0. */
        DMA_Cmd(DMA1_Stream0, ENABLE);                                  /* Enables the specified DMA1 Stream0. */
        
        USART8_SendDataCount += USART8_DMA_BufferSize_Tx;
        USART8_SendData_P    -= USART8_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART8_DMA_Buffer_Tx, USART8_Buffer_Tx, USART8_SendData_P);
        
        DMA_ClearFlag(DMA1_Stream0, DMA_FLAG_TCIF0);              /* Clears the DMA1 Stream0's pending flags. */
        DMA_Cmd(DMA1_Stream0, DISABLE);                           /* Disables the specified DMA1 Stream0. */
        while(DMA_GetCmdStatus(DMA1_Stream0) != DISABLE);         /* Wait for the specified DMA1 Stream0 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream0, USART8_SendData_P);  /* Writes the number of data units to be transferred on the DMA1 Stream0. */
        DMA_Cmd(DMA1_Stream0, ENABLE);                            /* Enables the specified DMA1 Stream0. */
        
        USART8_SendDataCount += USART8_SendData_P;
        USART8_SendData_P     = NULL;
      }
    }
    
    return Length;
#endif /* USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx
    if((USART9_RCC_Flag == false) || (USART9_GPIO_Flag == false) || (USART9_DMA_Tx_Flag == false) || (USART9_NVIC_Flag == false))
    {
      return NULL;
    }
    
