XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
    if(USART9_SendData_P >= USART9_BufferSize_Tx)
    {
      return NULL;
    }
    
    if(Length > (USART9_BufferSize_Tx - USART9_SendData_P))
    {
      memcpy(USART9_Buffer_Tx + USART9_SendData_P, Data, USART9_BufferSize_Tx - USART9_SendData_P);
      
      USART9_SendData_P = USART9_BufferSize_Tx;
      Length            = USART9_BufferSize_Tx - USART9_SendData_P;
    }
    else
    {
      memcpy(USART9_Buffer_Tx + USART9_SendData_P, Data, Length);
      
      USART9_SendData_P += Length;
    }
    
    if(USART9_SendData_Flag == false)
    {
      USART9_SendData_Flag = true;
      
      if(USART9_SendData_P > USART9_DMA_BufferSize_Tx)
      {
        memcpy(USART9_DMA_Buffer_Tx, USART9_Buffer_Tx, USART9_DMA_BufferSize_Tx);
        memmove(USART9_Buffer_Tx, USART9_Buffer_Tx + USART9_DMA_BufferSize_Tx, USART9_SendData_P - USART9_DMA_BufferSize_Tx);
        
        DMA_ClearFlag(DMA2_Stream0, DMA_FLAG_TCIF0);                    /* Clears the DMA2 Stream0's pending flags. */
        DMA_Cmd(DMA2_Stream0, DISABLE);                                 /* Disables the specified DMA2 Stream0. */
        while(DMA_GetCmdStatus(DMA2_Stream0) != DISABLE);               /* Wait for the specified DMA2 Stream0 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream0, USART9_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA2 Stream0. */
        DMA_Cmd(DMA2_Stream0, ENABLE);                                  /* Enables the specified DMA2 Stream0. */
        
        USART9_SendDataCount += USART9_DMA_BufferSize_Tx;
        USART9_SendData_P    -= USART9_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART9_DMA_Buffer_Tx, USART9_Buffer_Tx, USART9_SendData_P);
        
        DMA_ClearFlag(DMA2_Stream0, DMA_FLAG_TCIF0);              /* Clears the DMA2 Stream0's pending flags. */
        DMA_Cmd(DMA2_Stream0, DISABLE);                           /* Disables the specified DMA2 Stream0. */
        while(DMA_GetCmdStatus(DMA2_Stream0) != DISABLE);         /* Wait for the specified DMA2 Stream0 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream0, USART9_SendData_P);  /* Writes the number of data units to be transferred on the DMA2 Stream0. */
        DMA_Cmd(DMA2_Stream0, ENABLE);                            /* Enables the specified DMA2 Stream0. */
        
        USART9_SendDataCount += USART9_SendData_P;
        USART9_SendData_P     = NULL;
      }
    }
    
    return Length;
#endif /* USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx
    if((USART10_RCC_Flag == false) || (USART10_GPIO_Flag == false) || (USART10_DMA_Tx_Flag == false) || (USART10_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART10_SendData_P >= USART10_BufferSize_Tx)
    {
      return NULL;
    }
    
    if(Length > (USART10_BufferSize_Tx - USART10_SendData_P))
    {
      memcpy(USART10_Buffer_Tx + USART10_SendData_P, Data, USART10_BufferSize_Tx - USART10_SendData_P);
      
      USART10_SendData_P = USART10_BufferSize_Tx;
      Length             = USART10_BufferSize_Tx - USART10_SendData_P;
    }
    else
    {
      memcpy(USART10_Buffer_Tx + USART10_SendData_P, Data, Length);
      
      USART10_SendData_P += Length;
    }
    
    if(USART10_SendData_Flag == false)
    {
      USART10_SendData_Flag = true;
      
      if(USART10_SendData_P > USART10_DMA_BufferSize_Tx)
      {
        memcpy(USART10_DMA_Buffer_Tx, USART10_Buffer_Tx, USART10_DMA_BufferSize_Tx);
        memmove(USART10_Buffer_Tx, USART10_Buffer_Tx + USART10_DMA_BufferSize_Tx, USART10_SendData_P - USART10_DMA_BufferSize_Tx);
        
        DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);                      /* Clears the DMA2 Stream7's pending flags. */
        DMA_Cmd(DMA2_Stream7, DISABLE);                                   /* Disables the specified DMA2 Stream7. */
        while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);                 /* Wait for the specified DMA2 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream7, USART10_DMA_BufferSize_Tx);  /* Writes the number of data units to be transferred on the DMA2 Stream7. */
        DMA_Cmd(DMA2_Stream7, ENABLE);                                    /* Enables the specified DMA2 Stream7. */
        
        USART10_SendDataCount += USART10_DMA_BufferSize_Tx;
        USART10_SendData_P    -= USART10_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART10_DMA_Buffer_Tx, USART10_Buffer_Tx, USART10_SendData_P);
        
        DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);              /* Clears the DMA2 Stream7's pending flags. */
        DMA_Cmd(DMA2_Stream7, DISABLE);                           /* Disables the specified DMA2 Stream7. */
        while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);         /* Wait for the specified DMA2 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream7, USART10_SendData_P); /* Writes the number of data units to be transferred on the DMA2 Stream7. */
        DMA_Cmd(DMA2_Stream7, ENABLE);                            /* Enables the specified DMA2 Stream7. */
        
        USART10_SendDataCount += USART10_SendData_P;
        USART10_SendData_P     = NULL;
      }
    }
    
    return Length;
#endif /* USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx */
  }
#endif /* STM32F413_423xx */
  
  return NULL;
}

/****************************************************************
 * Function:    USART_GetReceiveData
 * Description: Get receive data.
 * Input:       USARTx: Where x can be 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 to select the USART or UART peripheral.
 *              Data:   To store the address of the receive data.
 *              Length: To read the length of the received data.
 * Output:
 * Return:      To read the number of the received data.
*****************************************************************/
uint32_t USART_GetReceiveData(USART_TypeDef* USARTx, void* Data, uint32_t Length)
{
  uint32_t number = NULL;
  
  if((Data == NULL) || (Length == NULL))
  {
    return NULL;
  }
  
  if(USARTx == USART1)
  {
#if USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx
    if((USART1_RCC_Flag == false) || (USART1_GPIO_Flag == false) || (USART1_DMA_Rx_Flag == false) || (USART1_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART1_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
