XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
    if(USART1_ReceiveData_P > Length)
    {
      memcpy(Data, USART1_Buffer_Rx, Length);
      memmove(USART1_Buffer_Rx, USART1_Buffer_Rx + Length, USART1_ReceiveData_P - Length);
      
      number                = Length;
      USART1_ReceiveData_P -= Length;
    }
    else
    {
      memcpy(Data, USART1_Buffer_Rx, USART1_ReceiveData_P);
      
      number               = USART1_ReceiveData_P;
      USART1_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx
    if((USART2_RCC_Flag == false) || (USART2_GPIO_Flag == false) || (USART2_DMA_Rx_Flag == false) || (USART2_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART2_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART2_ReceiveData_P > Length)
    {
      memcpy(Data, USART2_Buffer_Rx, Length);
      memmove(USART2_Buffer_Rx, USART2_Buffer_Rx + Length, USART2_ReceiveData_P - Length);
      
      number                = Length;
      USART2_ReceiveData_P -= Length;
    }
    else
    {
      memcpy(Data, USART2_Buffer_Rx, USART2_ReceiveData_P);
      
      number               = USART2_ReceiveData_P;
      USART2_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx
    if((USART3_RCC_Flag == false) || (USART3_GPIO_Flag == false) || (USART3_DMA_Rx_Flag == false) || (USART3_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART3_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART3_ReceiveData_P > Length)
    {
      memcpy(Data, USART3_Buffer_Rx, Length);
      memmove(USART3_Buffer_Rx, USART3_Buffer_Rx + Length, USART3_ReceiveData_P - Length);
      
      number                = Length;
      USART3_ReceiveData_P -= Length;
    }
    else
    {
      memcpy(Data, USART3_Buffer_Rx, USART3_ReceiveData_P);
      
      number               = USART3_ReceiveData_P;
      USART3_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx
    if((USART4_RCC_Flag == false) || (USART4_GPIO_Flag == false) || (USART4_DMA_Rx_Flag == false) || (USART4_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART4_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART4_ReceiveData_P > Length)
    {
      memcpy(Data, USART4_Buffer_Rx, Length);
      memmove(USART4_Buffer_Rx, USART4_Buffer_Rx + Length, USART4_ReceiveData_P - Length);
      
      number                = Length;
      USART4_ReceiveData_P -= Length;
    }
    else
    {
      memcpy(Data, USART4_Buffer_Rx, USART4_ReceiveData_P);
      
      number               = USART4_ReceiveData_P;
      USART4_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx
    if((USART5_RCC_Flag == false) || (USART5_GPIO_Flag == false) || (USART5_DMA_Rx_Flag == false) || (USART5_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART5_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART5_ReceiveData_P > Length)
    {
      memcpy(Data, USART5_Buffer_Rx, Length);
      memmove(USART5_Buffer_Rx, USART5_Buffer_Rx + Length, USART5_ReceiveData_P - Length);
      
      number                = Length;
      USART5_ReceiveData_P -= Length;
    }
    else
    {
      memcpy(Data, USART5_Buffer_Rx, USART5_ReceiveData_P);
      
      number               = USART5_ReceiveData_P;
      USART5_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx
    if((USART6_RCC_Flag == false) || (USART6_GPIO_Flag == false) || (USART6_DMA_Rx_Flag == false) || (USART6_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART6_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART6_ReceiveData_P > Length)
    {
      memcpy(Data, USART6_Buffer_Rx, Length);
      memmove(USART6_Buffer_Rx, USART6_Buffer_Rx + Length, USART6_ReceiveData_P - Length);
      
      number                = Length;
      USART6_ReceiveData_P -= Length;
    }
    else
    {
      memcpy(Data, USART6_Buffer_Rx, USART6_ReceiveData_P);
      
      number               = USART6_ReceiveData_P;
      USART6_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx
    if((USART7_RCC_Flag == false) || (USART7_GPIO_Flag == false) || (USART7_DMA_Rx_Flag == false) || (USART7_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART7_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART7_ReceiveData_P > Length)
    {
      memcpy(Data, USART7_Buffer_Rx, Length);
      memmove(USART7_Buffer_Rx, USART7_Buffer_Rx + Length, USART7_ReceiveData_P - Length);
      
      number                = Length;
      USART7_ReceiveData_P -= Length;
    }
    else
    {
      memcpy(Data, USART7_Buffer_Rx, USART7_ReceiveData_P);
      
      number               = USART7_ReceiveData_P;
      USART7_ReceiveData_P = NULL;
    }
    
