XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
    return number;
#endif /* USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx
    if((USART8_RCC_Flag == false) || (USART8_GPIO_Flag == false) || (USART8_DMA_Rx_Flag == false) || (USART8_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART8_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART8_ReceiveData_P > Length)
    {
      memcpy(Data, USART8_Buffer_Rx, Length);
      memmove(USART8_Buffer_Rx, USART8_Buffer_Rx + Length, USART8_ReceiveData_P - Length);
      
      number                = Length;
      USART8_ReceiveData_P -= Length;
    }
    else
    {
      memcpy(Data, USART8_Buffer_Rx, USART8_ReceiveData_P);
      
      number               = USART8_ReceiveData_P;
      USART8_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx
    if((USART9_RCC_Flag == false) || (USART9_GPIO_Flag == false) || (USART9_DMA_Rx_Flag == false) || (USART9_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART9_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART9_ReceiveData_P > Length)
    {
      memcpy(Data, USART9_Buffer_Rx, Length);
      memmove(USART9_Buffer_Rx, USART9_Buffer_Rx + Length, USART9_ReceiveData_P - Length);
      
      number                = Length;
      USART9_ReceiveData_P -= Length;
    }
    else
    {
      memcpy(Data, USART9_Buffer_Rx, USART9_ReceiveData_P);
      
      number               = USART9_ReceiveData_P;
      USART9_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx
    if((USART10_RCC_Flag == false) || (USART10_GPIO_Flag == false) || (USART10_DMA_Rx_Flag == false) || (USART10_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART10_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART10_ReceiveData_P > Length)
    {
      memcpy(Data, USART10_Buffer_Rx, Length);
      memmove(USART10_Buffer_Rx, USART10_Buffer_Rx + Length, USART10_ReceiveData_P - Length);
      
      number                 = Length;
      USART10_ReceiveData_P -= Length;
    }
    else
    {
      memcpy(Data, USART10_Buffer_Rx, USART10_ReceiveData_P);
      
      number                = USART10_ReceiveData_P;
      USART10_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx */
  }
#endif /* STM32F413_423xx */
  
  return NULL;
}

/****************************************************************
 * Function:    USART1_IRQHandler
 * Description: USART1 IRQ handler.
 * Input:
 * Output:
 * Return:
*****************************************************************/
void USART1_IRQHandler(void)
{
#if USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx
  if(USART_GetITStatus(USART1, USART_IT_TC) != RESET) /* Checks whether the specified USART interrupt has occurred or not. */
  {
    USART_ClearITPendingBit(USART1, USART_IT_TC);     /* Clears the USARTx's interrupt pending bits. */
    
    if(USART1_SendData_P == NULL)
    {
      USART1_SendData_Flag = false;
      
      USART_SendDataFinishCallback(USART1);
    }
    else
    {
      if(USART1_SendData_P > USART1_DMA_BufferSize_Tx)
      {
        memcpy(USART1_DMA_Buffer_Tx, USART1_Buffer_Tx, USART1_DMA_BufferSize_Tx);
        memmove(USART1_Buffer_Tx, USART1_Buffer_Tx + USART1_DMA_BufferSize_Tx, USART1_SendData_P - USART1_DMA_BufferSize_Tx);
        
        DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);                    /* Clears the DMA2 Stream7's pending flags. */
        DMA_Cmd(DMA2_Stream7, DISABLE);                                 /* Disables the specified DMA2 Stream7. */
        while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);               /* Wait for the specified DMA2 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream7, USART1_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA2 Stream7. */
        DMA_Cmd(DMA2_Stream7, ENABLE);                                  /* Enables the specified DMA2 Stream7. */
        
        USART1_SendDataCount += USART1_DMA_BufferSize_Tx;
        USART1_SendData_P    -= USART1_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART1_DMA_Buffer_Tx, USART1_Buffer_Tx, USART1_SendData_P);
        
        DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);              /* Clears the DMA2 Stream7's pending flags. */
        DMA_Cmd(DMA2_Stream7, DISABLE);                           /* Disables the specified DMA2 Stream7. */
        while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);         /* Wait for the specified DMA2 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream7, USART1_SendData_P);  /* Writes the number of data units to be transferred on the DMA2 Stream7. */
        DMA_Cmd(DMA2_Stream7, ENABLE);                            /* Enables the specified DMA2 Stream7. */
        
        USART1_SendDataCount += USART1_SendData_P;
        USART1_SendData_P     = NULL;
      }
    }
  }
#endif /* USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx */
  
#if USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx
  if(USART_GetITStatus(USART1, USART_IT_IDLE) != RESET) /* Checks whether the specified USART interrupt has occurred or not. */
  {
    USART_ReceiveData(USART1);                          /* Returns the most recent received data by the USARTx peripheral. */
    
    uint32_t number = USART1_DMA_BufferSize_Rx - DMA_GetCurrDataCounter(DMA2_Stream2);  /* Returns the number of remaining data units in the current DMA2 Stream2 transfer. */
    
    USART1_ReceiveDataCount += number;
    
    if(number > (USART1_BufferSize_Rx - USART1_ReceiveData_P))
    {
      if(number < USART1_BufferSize_Rx)
      {
        memmove(USART1_Buffer_Rx, USART1_Buffer_Rx + (number - (USART1_BufferSize_Rx - USART1_ReceiveData_P)), USART1_BufferSize_Rx - number);
        memcpy(USART1_Buffer_Rx + (USART1_BufferSize_Rx - number), USART1_DMA_Buffer_Rx, number);
      }
      else
      {
        memcpy(USART1_Buffer_Rx, USART1_DMA_Buffer_Rx + (number - USART1_BufferSize_Rx), USART1_BufferSize_Rx);
      }
      
      USART1_ReceiveData_P = USART1_BufferSize_Rx;
    }
    else
    {
      memcpy(USART1_Buffer_Rx + USART1_ReceiveData_P, USART1_DMA_Buffer_Rx, number);
      
      USART1_ReceiveData_P += number;
    }
    
    DMA_Cmd(DMA2_Stream2, DISABLE);                                 /* Disables the specified DMA2 Stream2. */
    while(DMA_GetCmdStatus(DMA2_Stream2) != DISABLE);               /* Wait for the specified DMA2 Stream2 disable to finish. */
    DMA_SetCurrDataCounter(DMA2_Stream2, USART1_DMA_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA2 Stream2. */
    DMA_Cmd(DMA2_Stream2, ENABLE);                                  /* Enables the specified DMA2 Stream2. */
    
    USART_ReceiveDataFinishCallback(USART1);
  }
#endif /* USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx */
}

/****************************************************************
 * Function:    USART2_IRQHandler
 * Description: USART2 IRQ handler.
 * Input:
 * Output:
 * Return:
*****************************************************************/
void USART2_IRQHandler(void)
{
#if USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx
  if(USART_GetITStatus(USART2, USART_IT_TC) != RESET) /* Checks whether the specified USART interrupt has occurred or not. */
  {
    USART_ClearITPendingBit(USART2, USART_IT_TC);     /* Clears the USARTx's interrupt pending bits. */
    
    if(USART2_SendData_P == NULL)
    {
      USART2_SendData_Flag = false;
      
      USART_SendDataFinishCallback(USART2);
    }
    else
    {
      if(USART2_SendData_P > USART2_DMA_BufferSize_Tx)
      {
        memcpy(USART2_DMA_Buffer_Tx, USART2_Buffer_Tx, USART2_DMA_BufferSize_Tx);
        memmove(USART2_Buffer_Tx, USART2_Buffer_Tx + USART2_DMA_BufferSize_Tx, USART2_SendData_P - USART2_DMA_BufferSize_Tx);
        
        DMA_ClearFlag(DMA1_Stream6, DMA_FLAG_TCIF6);                    /* Clears the DMA1 Stream6's pending flags. */
        DMA_Cmd(DMA1_Stream6, DISABLE);                                 /* Disables the specified DMA1 Stream6. */
        while(DMA_GetCmdStatus(DMA1_Stream6) != DISABLE);               /* Wait for the specified DMA1 Stream6 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream6, USART2_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream6. */
        DMA_Cmd(DMA1_Stream6, ENABLE);                                  /* Enables the specified DMA1 Stream6. */
        
        USART2_SendDataCount += USART2_DMA_BufferSize_Tx;
        USART2_SendData_P    -= USART2_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART2_DMA_Buffer_Tx, USART2_Buffer_Tx, USART2_SendData_P);
        
