XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
    if(number > (USART9_BufferSize_Rx - USART9_ReceiveData_P))
    {
      if(number < USART9_BufferSize_Rx)
      {
        memmove(USART9_Buffer_Rx, USART9_Buffer_Rx + (number - (USART9_BufferSize_Rx - USART9_ReceiveData_P)), USART9_BufferSize_Rx - number);
        memcpy(USART9_Buffer_Rx + (USART9_BufferSize_Rx - number), USART9_DMA_Buffer_Rx, number);
      }
      else
      {
        memcpy(USART9_Buffer_Rx, USART9_DMA_Buffer_Rx + (number - USART9_BufferSize_Rx), USART9_BufferSize_Rx);
      }
      
      USART9_ReceiveData_P = USART9_BufferSize_Rx;
    }
    else
    {
      memcpy(USART9_Buffer_Rx + USART9_ReceiveData_P, USART9_DMA_Buffer_Rx, number);
      
      USART9_ReceiveData_P += number;
    }
    
    DMA_Cmd(DMA2_Stream7, DISABLE);                                 /* Disables the specified DMA2 Stream7. */
    while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);               /* Wait for the specified DMA2 Stream7 disable to finish. */
    DMA_SetCurrDataCounter(DMA2_Stream7, USART9_DMA_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA2 Stream7. */
    DMA_Cmd(DMA2_Stream7, ENABLE);                                  /* Enables the specified DMA2 Stream7. */
    
    USART_ReceiveDataFinishCallback(UART9);
  }
#endif /* USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx */
}

/****************************************************************
 * Function:    UART10_IRQHandler
 * Description: UART10 IRQ handler.
 * Input:
 * Output:
 * Return:
*****************************************************************/
void UART10_IRQHandler(void)
{
#if USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx
  if(USART_GetITStatus(UART10, USART_IT_TC) != RESET) /* Checks whether the specified USART interrupt has occurred or not. */
  {
    USART_ClearITPendingBit(UART10, USART_IT_TC);     /* Clears the USARTx's interrupt pending bits. */
    
    if(USART10_SendData_P == NULL)
    {
      USART10_SendData_Flag = false;
      
      USART_SendDataFinishCallback(UART10);
    }
    else
    {
      if(USART10_SendData_P > USART10_DMA_BufferSize_Tx)
      {
        memcpy(USART10_DMA_Buffer_Tx, USART10_Buffer_Tx, USART10_DMA_BufferSize_Tx);
        memmove(USART10_Buffer_Tx, USART10_Buffer_Tx + USART10_DMA_BufferSize_Tx, USART10_SendData_P - USART10_DMA_BufferSize_Tx);
        
        DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);                      /* Clears the DMA2 Stream7's pending flags. */
        DMA_Cmd(DMA2_Stream7, DISABLE);                                   /* Disables the specified DMA2 Stream7. */
        while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);                 /* Wait for the specified DMA2 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream7, USART10_DMA_BufferSize_Tx);  /* Writes the number of data units to be transferred on the DMA2 Stream7. */
        DMA_Cmd(DMA2_Stream7, ENABLE);                                    /* Enables the specified DMA2 Stream7. */
        
        USART10_SendDataCount += USART10_DMA_BufferSize_Tx;
        USART10_SendData_P    -= USART10_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART10_DMA_Buffer_Tx, USART10_Buffer_Tx, USART10_SendData_P);
        
        DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);              /* Clears the DMA2 Stream7's pending flags. */
        DMA_Cmd(DMA2_Stream7, DISABLE);                           /* Disables the specified DMA2 Stream7. */
        while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);         /* Wait for the specified DMA2 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream7, USART10_SendData_P); /* Writes the number of data units to be transferred on the DMA2 Stream7. */
        DMA_Cmd(DMA2_Stream7, ENABLE);                            /* Enables the specified DMA2 Stream7. */
        
        USART10_SendDataCount += USART10_SendData_P;
        USART10_SendData_P     = NULL;
      }
    }
  }
#endif /* USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx */
  
#if USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx
  if(USART_GetITStatus(UART10, USART_IT_IDLE) != RESET) /* Checks whether the specified USART interrupt has occurred or not. */
  {
    USART_ReceiveData(UART10);                          /* Returns the most recent received data by the USARTx peripheral. */
    
    uint32_t number = USART10_DMA_BufferSize_Rx - DMA_GetCurrDataCounter(DMA2_Stream0); /* Returns the number of remaining data units in the current DMA2 Stream0 transfer. */
    
    USART10_ReceiveDataCount += number;
    
    if(number > (USART10_BufferSize_Rx - USART10_ReceiveData_P))
    {
      if(number < USART10_BufferSize_Rx)
      {
        memmove(USART10_Buffer_Rx, USART10_Buffer_Rx + (number - (USART10_BufferSize_Rx - USART10_ReceiveData_P)), USART10_BufferSize_Rx - number);
        memcpy(USART10_Buffer_Rx + (USART10_BufferSize_Rx - number), USART10_DMA_Buffer_Rx, number);
      }
      else
      {
        memcpy(USART10_Buffer_Rx, USART10_DMA_Buffer_Rx + (number - USART10_BufferSize_Rx), USART10_BufferSize_Rx);
      }
      
      USART10_ReceiveData_P = USART10_BufferSize_Rx;
    }
    else
    {
      memcpy(USART10_Buffer_Rx + USART10_ReceiveData_P, USART10_DMA_Buffer_Rx, number);
      
      USART10_ReceiveData_P += number;
    }
    
    DMA_Cmd(DMA2_Stream0, DISABLE);                                   /* Disables the specified DMA2 Stream0. */
    while(DMA_GetCmdStatus(DMA2_Stream0) != DISABLE);                 /* Writes the number of data units to be transferred on the DMA2 Stream0. */
    DMA_SetCurrDataCounter(DMA2_Stream0, USART10_DMA_BufferSize_Rx);  /* Writes the number of data units to be transferred on the DMA2 Stream0. */
    DMA_Cmd(DMA2_Stream0, ENABLE);                                    /* Enables the specified DMA2 Stream0. */
    
    USART_ReceiveDataFinishCallback(UART10);
  }
#endif /* USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx */
}
#endif /* STM32F413_423xx */

/****************************************************************
 * Function:    USART_SendDataFinishCallback
 * Description: Send data finish callback.
 * Input:       USARTx: Where x can be 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 to select the USART or UART peripheral.
 * Output:
 * Return:
*****************************************************************/
static void USART_SendDataFinishCallback(USART_TypeDef* USARTx)
{
  if(USARTx == USART1)
  {
#if USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx
    if(USART1_SendDataFinishCallback != NULL)
    {
      USART1_SendDataFinishCallback();
    }
#endif /* USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx
    if(USART2_SendDataFinishCallback != NULL)
    {
      USART2_SendDataFinishCallback();
    }
#endif /* USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx
    if(USART3_SendDataFinishCallback != NULL)
    {
      USART3_SendDataFinishCallback();
    }
#endif /* USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx
    if(USART4_SendDataFinishCallback != NULL)
    {
      USART4_SendDataFinishCallback();
    }
#endif /* USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx
    if(USART5_SendDataFinishCallback != NULL)
    {
      USART5_SendDataFinishCallback();
    }
#endif /* USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx
    if(USART6_SendDataFinishCallback != NULL)
    {
      USART6_SendDataFinishCallback();
    }
#endif /* USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx
    if(USART7_SendDataFinishCallback != NULL)
    {
      USART7_SendDataFinishCallback();
    }
#endif /* USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx
    if(USART8_SendDataFinishCallback != NULL)
    {
      USART8_SendDataFinishCallback();
    }
#endif /* USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx
    if(USART9_SendDataFinishCallback != NULL)
    {
      USART9_SendDataFinishCallback();
    }
#endif /* USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx
    if(USART10_SendDataFinishCallback != NULL)
    {
      USART10_SendDataFinishCallback();
    }
#endif /* USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx */
  }
#endif /* STM32F413_423xx */
}

/****************************************************************
 * Function:    USART_ReceiveDataFinishCallback
 * Description: Receive data finish callback.
 * Input:       USARTx: Where x can be 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 to select the USART or UART peripheral.
 * Output:
 * Return:
*****************************************************************/
static void USART_ReceiveDataFinishCallback(USART_TypeDef* USARTx)
{
  if(USARTx == USART1)
  {
#if USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx
    if(USART1_ReceiveDataFinishCallback != NULL)
    {
      USART1_ReceiveDataFinishCallback();
    }
#endif /* USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx
    if(USART2_ReceiveDataFinishCallback != NULL)
    {
      USART2_ReceiveDataFinishCallback();
    }
#endif /* USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx
    if(USART3_ReceiveDataFinishCallback != NULL)
    {
      USART3_ReceiveDataFinishCallback();
    }
#endif /* USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx
    if(USART4_ReceiveDataFinishCallback != NULL)
    {
      USART4_ReceiveDataFinishCallback();
    }
#endif /* USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx
    if(USART5_ReceiveDataFinishCallback != NULL)
    {
      USART5_ReceiveDataFinishCallback();
    }
#endif /* USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx
    if(USART6_ReceiveDataFinishCallback != NULL)
    {
      USART6_ReceiveDataFinishCallback();
    }
#endif /* USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx
    if(USART7_ReceiveDataFinishCallback != NULL)
    {
      USART7_ReceiveDataFinishCallback();
    }
#endif /* USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx
    if(USART8_ReceiveDataFinishCallback != NULL)
    {
      USART8_ReceiveDataFinishCallback();
    }
#endif /* USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx
    if(USART9_ReceiveDataFinishCallback != NULL)
    {
      USART9_ReceiveDataFinishCallback();
    }
#endif /* USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx
    if(USART10_ReceiveDataFinishCallback != NULL)
    {
      USART10_ReceiveDataFinishCallback();
    }
#endif /* USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx */
  }
#endif /* STM32F413_423xx */
}

/****************************************************************
 * Function:    USART_SetSendDataFinishCallback
 * Description: Set send data finish callback.
 * Input:       USARTx:   Where x can be 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 to select the USART or UART peripheral.
 *              Function: Function pointer.
 * Output:
 * Return:
*****************************************************************/
void USART_SetSendDataFinishCallback(USART_TypeDef* USARTx, void (*Function)(void))
{
  if(Function == NULL)
  {
    return;
  }
  
  if(USARTx == USART1)
  {
#if USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx
    USART1_SendDataFinishCallback = Function;
#endif /* USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx
    USART2_SendDataFinishCallback = Function;
#endif /* USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx
    USART3_SendDataFinishCallback = Function;
#endif /* USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx
    USART4_SendDataFinishCallback = Function;
#endif /* USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx
    USART5_SendDataFinishCallback = Function;
#endif /* USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx
    USART6_SendDataFinishCallback = Function;
#endif /* USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx
    USART7_SendDataFinishCallback = Function;
#endif /* USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx
    USART8_SendDataFinishCallback = Function;
#endif /* USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx
    USART9_SendDataFinishCallback = Function;
#endif /* USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx
    USART10_SendDataFinishCallback = Function;
#endif /* USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx */
  }
#endif /* STM32F413_423xx */
}

/****************************************************************
 * Function:    USART_SetReceiveDataFinishCallback
 * Description: Set receive data finish callback.
 * Input:       USARTx:   Where x can be 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 to select the USART or UART peripheral.
 *              Function: Function pointer.
 * Output:
 * Return:
*****************************************************************/
void USART_SetReceiveDataFinishCallback(USART_TypeDef* USARTx, void (*Function)(void))
{
  if(Function == NULL)
  {
    return;
  }
  
  if(USARTx == USART1)
  {
#if USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx
    USART1_ReceiveDataFinishCallback = Function;
#endif /* USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx
    USART2_ReceiveDataFinishCallback = Function;
#endif /* USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx
    USART3_ReceiveDataFinishCallback = Function;
#endif /* USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx
    USART4_ReceiveDataFinishCallback = Function;
#endif /* USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx
    USART5_ReceiveDataFinishCallback = Function;
#endif /* USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx
    USART6_ReceiveDataFinishCallback = Function;
#endif /* USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx
    USART7_ReceiveDataFinishCallback = Function;
#endif /* USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx
    USART8_ReceiveDataFinishCallback = Function;
#endif /* USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx
    USART9_ReceiveDataFinishCallback = Function;
#endif /* USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx
    USART10_ReceiveDataFinishCallback = Function;
#endif /* USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx */
  }
#endif /* STM32F413_423xx */
}

/****************************************************************
 * Function:    USART_ClearSendDataFinishCallback
 * Description: Clear send data finish callback.
 * Input:       USARTx: Where x can be 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 to select the USART or UART peripheral.
 * Output:
 * Return:
*****************************************************************/
void USART_ClearSendDataFinishCallback(USART_TypeDef* USARTx)
{
  if(USARTx == USART1)
  {
#if USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx
    USART1_SendDataFinishCallback = NULL;
#endif /* USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx
    USART2_SendDataFinishCallback = NULL;
#endif /* USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx
    USART3_SendDataFinishCallback = NULL;
#endif /* USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx
    USART4_SendDataFinishCallback = NULL;
#endif /* USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx
    USART5_SendDataFinishCallback = NULL;
#endif /* USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx
    USART6_SendDataFinishCallback = NULL;
#endif /* USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx
    USART7_SendDataFinishCallback = NULL;
#endif /* USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx
    USART8_SendDataFinishCallback = NULL;
#endif /* USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx
    USART9_SendDataFinishCallback = NULL;
#endif /* USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx
    USART10_SendDataFinishCallback = NULL;
#endif /* USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx */
  }
#endif /* STM32F413_423xx */
}

