XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
  return NULL;
}

/****************************************************************
 * Function:    USART_GetReceiveBufferUnilizationRatio
 * Description: Get the utilization rate of the receive buffer.
 * Input:       USARTx: Where x can be 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 to select the USART or UART peripheral.
 * Output:
 * Return:      Receive buffer utilization.
*****************************************************************/
float USART_GetReceiveBufferUnilizationRatio(USART_TypeDef* USARTx)
{
  if(USARTx == USART1)
  {
#if USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx
    return (float)USART1_ReceiveData_P / (float)USART1_BufferSize_Rx;
#endif /* USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx
    return (float)USART2_ReceiveData_P / (float)USART2_BufferSize_Rx;
#endif /* USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx
    return (float)USART3_ReceiveData_P / (float)USART3_BufferSize_Rx;
#endif /* USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx
    return (float)USART4_ReceiveData_P / (float)USART4_BufferSize_Rx;
#endif /* USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx
    return (float)USART5_ReceiveData_P / (float)USART5_BufferSize_Rx;
#endif /* USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx
    return (float)USART6_ReceiveData_P / (float)USART6_BufferSize_Rx;
#endif /* USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx
    return (float)USART7_ReceiveData_P / (float)USART7_BufferSize_Rx;
#endif /* USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx
    return (float)USART8_ReceiveData_P / (float)USART8_BufferSize_Rx;
#endif /* USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx
    return (float)USART9_ReceiveData_P / (float)USART9_BufferSize_Rx;
#endif /* USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx
    return (float)USART10_ReceiveData_P / (float)USART10_BufferSize_Rx;
#endif /* USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx */
  }
#endif /* STM32F413_423xx */
  
  return NULL;
}

/****************************************************************
 * Function:    USART_ClearSendBuffer
 * Description: Clear the send buffer.
 * Input:       USARTx: Where x can be 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 to select the USART or UART peripheral.
 * Output:
 * Return:
*****************************************************************/
void USART_ClearSendBuffer(USART_TypeDef* USARTx)
{
  if(USARTx == USART1)
  {
#if USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx
    USART1_SendData_P = NULL;
#endif /* USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx
    USART2_SendData_P = NULL;
#endif /* USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx
    USART3_SendData_P = NULL;
#endif /* USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx
    USART4_SendData_P = NULL;
#endif /* USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx
    USART5_SendData_P = NULL;
#endif /* USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx
    USART6_SendData_P = NULL;
#endif /* USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx
    USART7_SendData_P = NULL;
#endif /* USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx
    USART8_SendData_P = NULL;
#endif /* USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx
    USART9_SendData_P = NULL;
#endif /* USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx
    USART10_SendData_P = NULL;
#endif /* USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx */
  }
#endif /* STM32F413_423xx */
}

/****************************************************************
 * Function:    USART_ClearReceiveBuffer
 * Description: Clear the receive buffer.
 * Input:       USARTx: Where x can be 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 to select the USART or UART peripheral.
 * Output:
 * Return:
*****************************************************************/
void USART_ClearReceiveBuffer(USART_TypeDef* USARTx)
{
  if(USARTx == USART1)
  {
#if USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx
    USART1_ReceiveData_P = NULL;
#endif /* USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx
    USART2_ReceiveData_P = NULL;
#endif /* USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx
    USART3_ReceiveData_P = NULL;
#endif /* USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx
    USART4_ReceiveData_P = NULL;
#endif /* USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx
    USART5_ReceiveData_P = NULL;
#endif /* USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx
    USART6_ReceiveData_P = NULL;
#endif /* USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx
    USART7_ReceiveData_P = NULL;
#endif /* USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx
    USART8_ReceiveData_P = NULL;
#endif /* USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx
    USART9_ReceiveData_P = NULL;
#endif /* USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx
    USART10_ReceiveData_P = NULL;
#endif /* USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx */
  }
#endif /* STM32F413_423xx */
}

/****************************************************************
 * Function:    USART_IsSendBufferEmpty
 * Description: Is the send buffer empty?
 * Input:       USARTx: Where x can be 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 to select the USART or UART peripheral.
 * Output:
 * Return:      true:  The send buffer is empty.
 *              false: The send buffer is not empty.
*****************************************************************/
bool USART_IsSendBufferEmpty(USART_TypeDef* USARTx)
{
  if(USARTx == USART1)
  {
#if USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx
    if(USART1_SendData_P == NULL)
    {
      return true;
    }
    else
    {
      return false;
    }
#endif /* USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx
    if(USART2_SendData_P == NULL)
    {
      return true;
    }
    else
    {
      return false;
    }
#endif /* USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx
    if(USART3_SendData_P == NULL)
    {
      return true;
    }
    else
    {
      return false;
    }
#endif /* USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx
    if(USART4_SendData_P == NULL)
    {
      return true;
    }
    else
    {
      return false;
    }
#endif /* USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx
    if(USART5_SendData_P == NULL)
    {
      return true;
    }
    else
    {
      return false;
    }
#endif /* USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx
    if(USART6_SendData_P == NULL)
    {
      return true;
    }
    else
    {
      return false;
    }
#endif /* USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx
    if(USART7_SendData_P == NULL)
    {
      return true;
    }
    else
    {
      return false;
    }
#endif /* USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx
    if(USART8_SendData_P == NULL)
    {
      return true;
    }
    else
    {
      return false;
    }
#endif /* USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx
    if(USART9_SendData_P == NULL)
    {
      return true;
    }
    else
    {
      return false;
    }
#endif /* USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx
    if(USART10_SendData_P == NULL)
    {
      return true;
    }
    else
    {
      return false;
    }
#endif /* USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx */
  }
#endif /* STM32F413_423xx */
  
